BOT_VERSION = "1.3.3"


# Bot info
DEVELOPER = "@Mag329"
DEVELOPER_SITE = "https://mag329.site"


# Other
BASE_QUARTER = 2


# MESSAGES
START_MESSAGE = "👋 Привет! Я бот для работы с <b>Московской электронной школой (МЭШ)</b>\nЯ помогу тебе следить за <b>расписанием</b>, <b>оценками</b>, <b>домашними заданиями</b> и т.д.\n\nДля начала нужно авторизоваться, нажми кнопку под сообщением"
ERROR_MESSAGE = "❌ <b>Произошла ошибка</b>"
ERROR_403_MESSAGE = "❌ <b>Произошла ошибка</b>\nВремя действия токена доступа истекло, пожалуйста авторизуйтесь заново"
SUCCESSFUL_AUTH = "✅ <b>Успешная авторизация</b>\n\nВы вошли как {0} {1} {2}"
UPDATE_NOTIFICATION_HEADER = "🚀 <b>Обновление</b>\n\n"
UPDATE_NOTIFICATION_FOOTER = f"\n\n\n<i>Версия бота:</i> {BOT_VERSION}"
